{"1471110885.000002": ["<@U0MFNAG05> has joined the channel", "<@U0MFNAG05> set the channel purpose: Discussion about all physics project related stuff", "Hong, let’s move our discussion here"], "1471111245.000002": ["just post it to this channel", "we try to avoid emails"], "1471194045.000002": ["Hong, can you send me a link where DeltaPSU shows their HVPS", "I can’t seem to find it"], "1471197525.000002": ["I’ve updated the working hours record, to indicated billable and unbillable (overhead) hours.  Please concur"], "1471207005.000002": ["I see", "Maybe worth asking a little more, I just don’t see anything that says high voltage", "looks like low voltage din rail supplies", "Thanks"], "1471261605.000002": ["Hong, I need your help with something", "Here is the Excel spreadsheet to calculate the coil currents to circulate the beam on the beam stop:"], "1471261725.000002": ["", "It’s designed to update the current every 2.2 micro-seconds. You can find it in row 6, column B (in red)"], "1471261845.000002": ["Unfortunately, the best we can hope is the ability to update the current every 100 micro-seconds", "I’ve tried to simply change the number, but it messes up the track", "Can you find the way to change the number to 100 us and also shorten the `Path Length` (row 7, column B) to about `20 ms`"], "1471261965.000002": ["The `Number of Points` (row 8, column B) should be 10,000", "Let me know if you have any questions"], "1471266405.000002": ["thanks"], "1471271085.000002": ["which ones in particular?", "Well, it shouldn’t effect the magnet currents", "ADC is the read back", "Do you feel that you have to in order to make it work?"], "1471271325.000002": ["see if you can keep it constant"], "1471272045.000002": ["Hong, you might find this useful"], "1471273485.000002": ["excellent"], "1471274685.000002": ["Looks good", "Can you make a new excel spreadsheet and post it?"], "1471274805.000002": ["ok", "how long is the `Path Length` now?"], "1471274925.000002": ["waiting", "ok"], "1471275045.000002": ["meanwhile, since I have to leave soon for few hours", "here is the LTspice model:", "", "Can you load it up"], "1471275165.000002": ["And then open V1 and first load DX into the it and run it and then load DY into it and also run it"], "1471275285.000002": ["Produce the plots of V1, Vn001, Ig1, where Vn001 is the voltage at L1 and Ig1 is the current at G1", "For this you need to save the DY into the text file like this one:", "", "where the first value is the time in milisecond, thus m at the end", "and the second column is the value of the current you got on your spreadsheet", "post all results here", "as well as updated excel spreadsheet"], "1471278525.000002": ["What's up?  Wireless is shitty here"], "1471281285.000002": ["Ye, absolutely", "Lowere the number of points", "Yup"], "1471281405.000002": ["We will expand it later, but for now let's go with 20 Ms"], "1471287165.000002": ["Can you put the traces on the same graph", "Also limit the simulation time to 20 Ms"], "1471287405.000002": ["I should be more specific: can you put V, Vn001 and Ig1 on the same plot", "And have one plot for each DY and DX"], "1471289445.000002": ["Bon appetite "], "1471290405.000002": ["I think it should be just v1", "That's the set voltage on the controller"], "1471290645.000002": ["ok sorry, it would be Vn002"], "1471290765.000002": ["the wire right outside of the V1 unit"], "1471290885.000002": ["Anyway to close this small gap?"], "1471291005.000002": ["ok, good", "Please add Ig1 back in and reduce the simulation time to 20 ms", "it’s in the one of the settings", "right now it’s 80 ms"], "1471291125.000002": ["no problem", "great !!!"], "1471291245.000002": ["Next is to find the way to save these traces as data points, do you think there is any way to do that", "Just update the spreadsheet and post it, thanks", "oh, you are ahead of me"], "1471291485.000002": ["Never mind, I just didn’t see it", "the traces have similar colors", "ignore"], "1471295085.000002": ["Can you plot them the same way you had a plot for DY vs DX"], "1471295205.000002": ["All three traces on the same plot"], "1471295685.000002": ["You can add these traces to the spread sheet"], "1471296165.000002": ["Can you make a plot of VX(n001) vs VY(n001) and so on"], "1471296285.000002": ["Once you don with that. Here is another spreadsheet:"], "1471296405.000002": ["", "Yes, if possible"], "1471296525.000002": ["The ideas is that the beam will dwell on the circular path that we looked at for 20 ms and the move to one of the targets in the above spread sheet and stay there for 7 ms and move back to the circular path and then go to the next target and so on", "Can you take the waveforms that you’ve created and place them between these 19 points"], "1471296645.000002": ["and stretch out the currents for the 19 point for 7 ms with 0.1 ms for each point, i.e. 70 exactly the same points for each of these", "you should have the wave form of 19*(7+20)/0.1 = 5130 points for 513 ms time", "feel free to ask any questions"], "1471297365.000002": ["can you set a minimum?"], "1471297605.000002": ["intersting", "even the input  voltage is resampled?"], "1471297725.000002": ["ok, then it is what it is", "Can we take the output of the LTspice and resample onto our input sampling rate", "just do a linear interpolation, doesn’t need to be in excel, matlab is good for it"], "1471297965.000002": ["Not sure I understand, I though I did, but...", "The problem you are having is with the new task not the old", "The simple circular path is ok?", "yes to which one :slightly_smiling_face:?"], "1471298085.000002": ["so, what I’m saying is take the output for the circular path and resample it to the input sampling", "19 times referst to adding the target path, which is a separate task"], "1471300125.000002": ["No, 19 constant current intervals for 7 ms each and 20 ms circular waveforms between them"], "1471312965.000002": ["Sorry, Hong.  Didn’t see your question", "the constant current is the current in the second spreadsheet that I posted", "<@U0MFNAG05> pinned their Excel Spreadsheet <https://logicalinn.slack.com/files/U0MFNAG05/F21H9GGBD/coilcurrents_29.40_target_paths.xlsx|CoilCurrents 29.40 target paths.xlsx> to this channel.", "I just pinned it"], "1471314765.000002": ["It’s in the gray box", "great"], "1471315005.000002": ["ye, everything is in Amps"]}